#+title: Tmux
#+setupfile: headers
#+options: unique-id:t
#+html_head: <meta name="description" content="Phundrak’s Tmux Configuration" />
#+html_head: <meta property="og:title" content="Phundrak’s Tmux Configuration" />
#+html_head: <meta property="og:description" content="Phundrak’s Tmux Configuration Detailed" />
#+property: header-args:tmux  :mkdirp yes :lexical t :exports code
#+property: header-args:tmux+ :tangle ~/.config/tmux/tmux.conf
#+property: header-args:tmux+ :mkdirp yes :noweb yes

* Keybindings
:PROPERTIES:
:CUSTOM_ID: Keybindings-tx80rdd1huj0
:END:
First of all, I don’t like prefixing all of my keybindings with ~C-b~,
that’s what I use in ~insert-mode~ in Emacs to make the cursor go back.
So instead, let’s set meta with space as my prefix.
#+begin_src tmux
unbind C-b
set -g prefix M-Space
bind M-Space send-prefix
#+end_src

Now, I will only add few keybindings on the root prefix that actually
do something immediately, I will mostly add keybindings that will lead
to other prefixes; I prefer by far to have keychords that are a bit
lengthy and mnemonic than some obscure “ ~C-M-&~ is for doing this and
that”.

#+name: std-prefix
| Keybinding | Command          | Prefix to go to |
|------------+------------------+-----------------|
| =«=          | select-window -p |                 |
| =»=          | select-window -n |                 |
| =p=          |                  | pane            |
| =y=          |                  | copy-mode       |

#+name: gen-keybinds
#+begin_src emacs-lisp :var keybinds=std-prefix :var prefix="prefix" :exports none
(mapconcat (lambda (keybind)
             (format "bind-key -T %s %s %s"
                     prefix
                     (string-replace "=" "" (car keybind))
                     (let* ((command (nth 1 keybind))
                            (command (if (string= "" command) nil command))
                            (goto-prefix (nth 2 keybind))
                            (goto-prefix (if (string= "" goto-prefix) nil (concat "switch-client -T " goto-prefix))))
                       (if (and command goto-prefix)
                           (concat command "\\; " goto-prefix)
                         (or command goto-prefix)))))
           keybinds
           "\n")
#+end_src

#+RESULTS: gen-keybinds
: bind-key -T prefix « select-window -p
: bind-key -T prefix » select-window -n
: bind-key -T prefix p switch-client -T pane
: bind-key -T prefix y switch-client -T copy-mode

#+begin_src tmux
<<gen-keybinds()>>
#+end_src

